{"ImydN7hy5h": "Why was the shirt happy to hang around the tank top? Because it was armless", "Tvcah31oWvc": "What do you call a fashionable lawn statue with an excellent sense of rhythmn? A metro-gnome", "DY8UvkqHexc": "Why did the half blind man fall in the well? Because he couldn't see that well!", "baFQZv4w5wc": "My New Years resolution is to stop leaving things so late.", "mOfqzdx51wc": "Why do mathematicians hate the U.S.? Because it's indivisible.", "LRnGeVfiNe": "Today a man knocked on my door and asked for a small donation towards the local swimming pool. I gave him a glass of water.", "Qn31o49Musc": "What do you call a fat psychic? A four-chin teller.", "NRfxXvkbFtc": "As I get older, I think of all the people I lost along the way. Maybe a career as a tour guide wasn't such a good idea.", "5TS7pbxcpb": "Why are oranges the smartest fruit? Because they are made to concentrate. ", "WD5oWLuXgFd": "I used to work at a stationery store.  But, I didn't feel like I was going anywhere.\r\n\r\nSo, I got a job at a travel agency.  Now, I know I'll be going places.", "AsWLeVDAItc": "Somebody stole my Microsoft Office and they're going to pay - you have my Word.", "qjV8EIRfVnb": "What did the shy pebble wish for? That she was a little boulder.", "jiVfq4MZDlb": "Sore throats are a pain in the neck!", "9hydxXgiiqc": "My wife said I was immature. So I told her to get out of my fort.", "pjyA59MRusc": "There’s a new type of broom out, it’s sweeping the nation.", "OfNRfaaUSf": "When I left school, I passed every one of my exams with the exception of Greek Mythology. It always was my achilles elbow", "8U0TClqOZDd": "What was the pumpkin’s favorite sport?\r\n\r\nSquash.", "3gibFB5Muzd": "Why was the robot angry? Because someone kept pressing his buttons!", "7UnjNRfapzd": "Why should you never trust a pig with a secret? Because it's bound to squeal.", "UKeiNeVnrc": "Mountains aren't just funny, they are hill areas", "bprz5wXSSvc": "Why did the scarecrow win an award? Because he was outstanding in his field.", "qrHJ69M7hFd": "What cheese can never be yours? Nacho cheese.", "2o4MZ8pjNuc": "It was so cold yesterday my computer froze. My own fault though, I left too many windows open.", "hNu4oORnOmb": "What do you call cheese by itself? Provolone.", "99UDQZgyIBd": "Two satellites decided to get married. The wedding wasn't much, but the reception was incredible.", "LRf2obFBskb": "Don’t interrupt someone working intently on a puzzle. Chances are, you’ll hear some crosswords.", "Xn3wX8hi3Ed": "Did you hear about the Mexican train killer? He had loco motives", "exXSCtkOKe": "Why do pirates not know the alphabet? They always get stuck at \"C\".", "sHlqrjyPf": "How can you tell a vampire has a cold? They start coffin.", "0DtrrOZDlyd": "Chances are if you' ve seen one shopping center, you've seen a mall.", "0189hNRf2g": "I'm tired of following my dreams. I'm just going to ask them where they are going and meet up with them later.", "LB5wHQSvzAd": "Where was the Declaration of Independence signed?\r\n\r\nAt the bottom! ", "DlOmrj3gaFd": "Why doesn't the Chimney-Sweep call out sick from work? Because he's used to working with a flue.", "8hFYojqz5h": "Why don't skeletons ride roller coasters? They don't have the stomach for it.", "lGlbhqjGJBd": "How does the moon cut his hair? Eclipse it.", "M7ElyAQCAd": "How was the snow globe feeling after the storm? A little shaken.", "BdxHQZ0TCd": "Can a kangaroo jump higher than the Empire State Building? Of course. The Empire State Building can't jump.", "Z8xHBQZ0Lmb": "I ordered a chicken and an egg from Amazon. I'll let you know.", "xXSv492wPmb": "What is red and smells like blue paint?\r\nRed paint!", "WvsHlyszkyd": "Why did the man put his money in the freezer? He wanted cold hard cash!", "AljqO7hFBd": "A farmer had 297 cows, when he rounded them up, he found he had 300", "7Uvc29hFIBd": "Why are mummys scared of vacation? They're afraid to unwind.", "jNmykbUSSvc": "I went to a book store and asked the saleswoman where the Self Help section was, she said if she told me it would defeat the purpose.", "K6UvXD5Mexc": "Which side of the chicken has more feathers? The outside.", "FdN7przPCtc": "You can't run through a camp site. You can only ran, because it's past tents.", "8prWvkOf2Ed": "What's the difference between a guitar and a fish? You can tune a guitar but you can't \"tuna\" fish!", "d21DAXSCljb": "How does a French skeleton say hello? Bone-jour.", "AsrrcprjNCd": "What concert costs only 45 cents? 50 cent featuring Nickelback.", "G6pWSvzAljb": "Animal Fact #25: Most bobcats are not named bob.", "82wHlbaapzd": "Me: If humans lose the ability to hear high frequency volumes as they get older, can my 4 week old son hear a dog whistle?\r\n\r\nDoctor: No, humans can never hear that high of a frequency no matter what age they are.\r\n\r\nMe: Trick question... dogs can't whistle.", "FtkqcFtrWvc": "I boiled a funny bone last night and had a laughing stock", "iGlOClqrrrc": "I dreamed about drowning in an ocean made out of orange soda last night. It took me a while to work out it was just a Fanta sea.", "n3o4orjiysc": "Why are skeletons so calm? Because nothing gets under their skin.", "yItzAdUKBd": "A horse walks into a bar. The bar tender says \"Hey.\" The horse says \"Sure.\"", "Albp49Mmjyd": "I was wondering why the frisbee was getting bigger, then it hit me.", "JeF69xAQSnb": "A red and a blue ship have just collided in the Caribbean. Apparently the survivors are marooned.", "H6EY0Dljiyd": "I always wanted to look into why I procrastinate, but I keep putting it off. ", "skGtHlORfFd": "What kind of music do planets listen to? Nep-tunes.", "m3wPZoz51ob": "Did you hear the news? FedEx and UPS are merging. They’re going to go by the name Fed-Up from now on.", "5wHexPC5hib": "I made a belt out of watches once... It was a waist of time.", "7U89MJeFdib": "Have you ever heard of a music group called Cellophane? They mostly wrap.", "0wcFBQfiGBd": "Did you hear the joke about the wandering nun? She was a roman catholic.", "nrrj3TfFdxc": "Why did the octopus beat the shark in a fight? Because it was well armed.", "vXgNZ0wcxAd": "I’m on a whiskey diet. I’ve lost three days already.", "iq4hVD599pb": "Doctor you've got you help me, I'm addicted to twitter. Doctor: I don't follow you.", "RSvzPuzAdpb": "Milk is also the fastest liquid on earth – its pasteurized before you even see it", "YLm39E6pjqc": "What do vegetarian zombies eat? Grrrrrainnnnnssss.", "qWDlOZozXDd": "It doesn't matter how much you push the envelope. It will still be stationary.", "NZDlb299Uf": "Where do sheep go to get their hair cut? The baa-baa shop.", "NmbFtH69hFd": "Our wedding was so beautiful, even the cake was in tiers.", "TC5TCt49prc": "Why did the A go to the bathroom and come out as an E? Because he had a vowel movement.", "ukOCYoWDQuc": "My sea sickness comes in waves.", "dpGtcxPKuzd": "Do you know where you can get chicken broth in bulk? The stock market.", "99MZvHJJtzd": "Why don't sharks eat clowns?  Because they taste funny.", "diNuky5M7pb": "We all know where the Big Apple is but does anyone know where the Minneapolis?", "VDdxcp4ob": "How do you make Lady Gaga cry? Poker face. ", "SSnW8xsrrjb": "How does a penguin build it’s house? Igloos it together.", "EdpjyXSfNCd": "What do you call a monkey in a mine field? A babooooom!\n", "SnrcpbhVKBd": "Where does Fonzie like to go for lunch? Chick-Fil-Eyyyyyyyy.", "mrHQKBA5MCd": "My boss told me that he was going to fire the person with the worst posture. I have a hunch, it might be me.", "rcxk3TSKusc": "What did the grape do when he got stepped on? He let out a little wine.", "lGJmrrzAsc": "A termite walks into a bar and asks “Is the bar tender here?”", "szXDA59U0wc": "I went on a date last night with a girl from the zoo. It was great. She’s a keeper.", "TvzdxXSCdFd": "Someone broke into my house last night and stole my limbo trophy. How low can you go?", "DtWSnydN7h": "It's difficult to say what my wife does, she sells sea shells by the sea shore.", "8UnrHe2T0g": "‘Put the cat out’ … ‘I didn’t realize it was on fire", "X8pWSKJRZg": "What does a clock do when it's hungry? It goes back four seconds!", "K6UKmykqrjb": "What is a witch's favorite subject in school? Spelling!", "AAIYo4MJmrc": "A magician was driving down the street and then he turned into a driveway.", "DtcaMmWDImb": "Why did Dracula lie in the wrong coffin? He made a grave mistake.", "hiVSCdUvXg": "I heard there was a new store called Moderation. They have everything there", "IRuX8U8EImb": "Who is the coolest Doctor in the hospital? The hip Doctor!", "6prjykbFd": "What's large, grey, and doesn't matter?\r\nAn irrelephant.\r\n", "6MZor4T79pb": "Why do trees seem suspicious on sunny days? Dunno, they're just a bit shady.", "cUvsHt41gFd": "A man walked in to a bar with some asphalt on his arm. He said “Two beers please, one for me and one for the road.”"}